package com.company;
import java.util.Scanner;
import java.util.Arrays;
public class Main {
    public static void main(String[] args) {
      /*  Scanner scanner = new Scanner(System.in);
        String name = scanner.next();
        System.out.println("Privet" + name);
        }
    }*/
        /*2. Отобразить в окне консоли аргументы командной строки в обратном порядке.*/
        Scanner scanner = new Scanner(System.in);
        /*System.out.print("Введите цифры: ");
        int value = scanner.nextInt();
        int mirror = 0;
        while (value != 0) {
            mirror = mirror * 10 + (value % 10);
            value = value / 10;
        }
        System.out.print("Обратная последовательность цифр: " + mirror);
    }
}*/
        /*3. Вывести заданное количество случайных чисел с переходом и без перехода на новую строку.*/
        int[] a = {1, 2, 3, 4, 5, 6, 7, 8, 9};
        for (int i : a) {
            System.out.println(i);
            System.out.print(i);
        }nt i : a) {
            System.out.println(i);
            System.out.print(i);
        }
    }
}nt i : a) {
        System.out.println(i);
        System.out.print(i);
        }


